garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC12F1572.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="DACCON1" edc:desc="Voltage Reference Control Register 1" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="DACCON1" edc:nzwidth="8" edc:por="---00000" edc:_addr="0x119">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DACR0" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR1" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR2" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR3" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR4" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DACR" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1f" edc:name="DACR" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="3" edc:_addr="0x11A"/>
        <edc:SFRDef edc:access="nnn-nnnn" edc:cname="APFCON" edc:desc="Alternate Pin Function Control Register" edc:impl="0xef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0000" edc:name="APFCON" edc:nzwidth="8" edc:por="000-0000" edc:_addr="0x11D">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="APFCON0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="P1SEL" edc:desc="" edc:mask="0x1" edc:name="P1SEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2SEL" edc:desc="" edc:mask="0x1" edc:name="P2SEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXCKSEL" edc:desc="" edc:mask="0x1" edc:name="TXCKSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1GSEL" edc:desc="" edc:mask="0x1" edc:name="T1GSEL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CWGBSEL" edc:desc="Timer1 Gate Input Pin Selection" edc:mask="0x1" edc:name="CWGBSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWGASEL" edc:desc="CCP3 Input/Output Pin Selection" edc:mask="0x1" edc:name="CWGASEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXDTSEL" edc:desc="" edc:mask="0x1" edc:name="RXDTSEL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x11E"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="3" edc:beginaddr="0x180" edc:endaddr="0x1A0" edc:regionid="sfr3">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x180"/>
        <edc:SFRDef edc:access="---n-nnn" edc:cname="ANSELA" edc:desc="" edc:impl="0x17" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---1-111" edc:name="ANSELA" edc:nzwidth="0x8" edc:por="---1-111" edc:_addr="0x18C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSA0" edc:desc="" edc:mask="0x1" edc:name="ANSA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA1" edc:desc="" edc:mask="0x1" edc:name="ANSA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA2" edc:desc="" edc:mask="0x1" edc:name="ANSA2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ANSA4" edc:desc="" edc:mask="0x1" edc:name="ANSA4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ANSELA" edc:desc="" edc:mask="0x1f" edc:name="ANSELA" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4" edc:_addr="0x18D"/>
        <edc:JoinedSFRDef edc:cname="PMADR" edc:desc="" edc:name="PMADR" edc:nzwidth="0x10" edc:_addr="0x191">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMADRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMADRL" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x191">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PMADRL" edc:desc="" edc:mask="0xff" edc:name="PMADRL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="-nnnnnnn" edc:cname="PMADRH" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="PMADRH" edc:nzwidth="0x8" edc:por="-0000000" edc:_addr="0x192">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PMADRH" edc:desc="" edc:mask="0x7f" edc:name="PMADRH" edc:nzwidth="7"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PMDAT" edc:desc="" edc:name="PMDAT" edc:nzwidth="0x10" edc:_addr="0x193">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMDATL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PMDATL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x193">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PMDATL" edc:desc="" edc:mask="0xff" edc:name="PMDATL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="PMDATH" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PMDATH" edc:nzwidth="0x8" edc:por="--xxxxxx" edc:_addr="0x194">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PMDATH" edc:desc="" edc:mask="0x3f" edc:name="PMDATH" edc:nzwidth="0x6"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="-nnnnnss" edc:cname="PMCON1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000q000" edc:name="PMCON1" edc:nzwidth="0x8" edc:por="-000x000" edc:_addr="0x195">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD" edc:desc="Read Control bit" edc:mask="0x1" edc:name="RD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WR" edc:desc="Write Control bit" edc:mask="0x1" edc:name="WR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WREN" edc:desc="Program/Erase Enable bit" edc:mask="0x1" edc:name="WREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WRERR" edc:desc="Sequence Error Flag bit" edc:mask="0x1" edc:name="WRERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FREE" edc:desc="Program FLASH Erase Enable bit" edc:mask="0x1" edc:name="FREE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LWLO" edc:desc="Load Write Latches Only bit" edc:mask="0x1" edc:name="LWLO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CFGS" edc:desc="FLASH Program / Data EEPROM or Configuration Select bit" edc:mask="0x1" edc:name="CFGS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="wwwwwwww" edc:cname="PMCON2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMCON2" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x196">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMCON2" edc:desc="" edc:mask="0xff" edc:name="PMCON2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------n-" edc:cname="VREGCON" edc:desc="" edc:impl="0x2" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------1-" edc:name="VREGCON" edc:nzwidth="8" edc:por="------0-" edc:_addr="0x197">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="VREGPM" edc:desc="" edc:mask="0x1" edc:name="VREGPM" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x198"/>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RCREG" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RCREG" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x199">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RCREG" edc:desc="" edc:mask="0xff" edc:name="RCREG" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="rp" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
