garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC12F1572.PIC
        <edc:SFRDef edc:access="-nnn--nn" edc:cname="PWM1OFCON" edc:desc="" edc:impl="0x73" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000--00" edc:name="PWM1OFCON" edc:nzwidth="8" edc:por="-000--00" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OFS" edc:desc="" edc:mask="0x3" edc:name="OFS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OFO" edc:desc="" edc:mask="0x1" edc:name="OFO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFM" edc:desc="" edc:mask="0x3" edc:name="OFM" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM1OFS0" edc:desc="" edc:mask="0x1" edc:name="PWM1OFS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1OFS1" edc:desc="" edc:mask="0x1" edc:name="PWM1OFS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM1OFM0" edc:desc="" edc:mask="0x1" edc:name="PWM1OFM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1OFM1" edc:desc="" edc:mask="0x1" edc:name="PWM1OFM1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM1OFS" edc:desc="" edc:mask="0x3" edc:name="PWM1OFS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM1OFMC" edc:desc="" edc:mask="0x1" edc:name="PWM1OFMC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1OFM" edc:desc="" edc:mask="0x3" edc:name="PWM1OFM" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OFS0" edc:desc="" edc:mask="0x1" edc:name="OFS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFS1" edc:desc="" edc:mask="0x1" edc:name="OFS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="OFM0" edc:desc="" edc:mask="0x1" edc:name="OFM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFM1" edc:desc="" edc:mask="0x1" edc:name="OFM1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="PWM2PH" edc:desc="" edc:name="PWM2PH" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA1">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM2PHL" edc:desc="8-bit period timer" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM2PHL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA1">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PH" edc:desc="" edc:mask="0xff" edc:name="PH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM2PHL0" edc:desc="" edc:mask="0x1" edc:name="PWM2PHL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PHL1" edc:desc="" edc:mask="0x1" edc:name="PWM2PHL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PHL2" edc:desc="" edc:mask="0x1" edc:name="PWM2PHL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PHL3" edc:desc="" edc:mask="0x1" edc:name="PWM2PHL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PHL4" edc:desc="" edc:mask="0x1" edc:name="PWM2PHL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PHL5" edc:desc="" edc:mask="0x1" edc:name="PWM2PHL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PHL6" edc:desc="" edc:mask="0x1" edc:name="PWM2PHL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PHL7" edc:desc="" edc:mask="0x1" edc:name="PWM2PHL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM2PHL" edc:desc="" edc:mask="0xff" edc:name="PWM2PHL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM2PHH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM2PHH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA2">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PH" edc:desc="" edc:mask="0xff" edc:name="PH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM2PHH0" edc:desc="" edc:mask="0x1" edc:name="PWM2PHH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PHH1" edc:desc="" edc:mask="0x1" edc:name="PWM2PHH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PHH2" edc:desc="" edc:mask="0x1" edc:name="PWM2PHH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PHH3" edc:desc="" edc:mask="0x1" edc:name="PWM2PHH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PHH4" edc:desc="" edc:mask="0x1" edc:name="PWM2PHH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PHH5" edc:desc="" edc:mask="0x1" edc:name="PWM2PHH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PHH6" edc:desc="" edc:mask="0x1" edc:name="PWM2PHH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2PHH7" edc:desc="" edc:mask="0x1" edc:name="PWM2PHH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM2PHH" edc:desc="" edc:mask="0xff" edc:name="PWM2PHH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM2DC" edc:desc="" edc:name="PWM2DC" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA3">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM2DCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM2DCL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA3">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM2DCL0" edc:desc="" edc:mask="0x1" edc:name="PWM2DCL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2DCL1" edc:desc="" edc:mask="0x1" edc:name="PWM2DCL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2DCL2" edc:desc="" edc:mask="0x1" edc:name="PWM2DCL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2DCL3" edc:desc="" edc:mask="0x1" edc:name="PWM2DCL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2DCL4" edc:desc="" edc:mask="0x1" edc:name="PWM2DCL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2DCL5" edc:desc="" edc:mask="0x1" edc:name="PWM2DCL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2DCL6" edc:desc="" edc:mask="0x1" edc:name="PWM2DCL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2DCL7" edc:desc="" edc:mask="0x1" edc:name="PWM2DCL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM2DCL" edc:desc="" edc:mask="0xff" edc:name="PWM2DCL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
